u1f992/hal_psoc4200l/hal/mtb-pdl-cat2-psoc4200l/devices/include/cy8c4248lti_l475.h
/***************************************************************************//**
* \file cy8c4248lti_l475.h
*
* \brief
* CY8C4248LTI-L475 device header
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CY8C4248LTI_L475_H_
#define _CY8C4248LTI_L475_H_

/**
* \addtogroup group_device CY8C4248LTI-L475
* \{
*/

/**
* \addtogroup Configuration_of_CMSIS
* \{
*/

/*******************************************************************************
*                         Interrupt Number Definition
*******************************************************************************/

typedef enum {
  /* ARM Cortex-M0 Core Interrupt Numbers */
  Reset_IRQn                        = -15,      /*!< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn               = -14,      /*!< -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn                    = -13,      /*!< -13 Hard Fault, all classes of Fault */
  SVCall_IRQn                       =  -5,      /*!<  -5 System Service Call via SVC instruction */
  PendSV_IRQn                       =  -2,      /*!<  -2 Pendable request for system service */
  SysTick_IRQn                      =  -1,      /*!<  -1 System Tick Timer */
  /* CY8C4248LTI-L475 Peripheral Interrupt Numbers */
  ioss_interrupts_gpio_0_IRQn       =   0,      /*!<   0 [DeepSleep] GPIO P0 */
  ioss_interrupts_gpio_1_IRQn       =   1,      /*!<   1 [DeepSleep] GPIO P1 */
  ioss_interrupts_gpio_2_IRQn       =   2,      /*!<   2 [DeepSleep] GPIO P2 */
  ioss_interrupts_gpio_3_IRQn       =   3,      /*!<   3 [DeepSleep] GPIO P3 */
  ioss_interrupts_gpio_4_IRQn       =   4,      /*!<   4 [DeepSleep] GPIO P4 */
  ioss_interrupts_gpio_13_IRQn      =   5,      /*!<   5 [DeepSleep] GPIO P13 (USB Wakeup) */
  ioss_interrupt_gpio_IRQn          =   6,      /*!<   6 [DeepSleep] GPIO All Ports (P5-P12 shared) */
  lpcomp_interrupt_IRQn             =   7,      /*!<   7 [DeepSleep] LPCOMP trigger interrupt */
  srss_interrupt_wdt_IRQn           =   8,      /*!<   8 [DeepSleep] WDT */
  scb_0_interrupt_IRQn              =   9,      /*!<   9 [DeepSleep] SCB #0 */
  scb_1_interrupt_IRQn              =  10,      /*!<  10 [DeepSleep] SCB #1 */
  scb_2_interrupt_IRQn              =  11,      /*!<  11 [DeepSleep] SCB #2 */
  scb_3_interrupt_IRQn              =  12,      /*!<  12 [DeepSleep] SCB #3 */
  pass_0_interrupt_ctbs_IRQn        =  13,      /*!<  13 [DeepSleep] CTBm Interrupt (all opamps) */
  cpuss_interrupt_dma_IRQn          =  14,      /*!<  14 [Active] DMA Interrupt */
  cpuss_interrupt_spcif_IRQn        =  15,      /*!<  15 [Active] SPCIF interrupt */
  srss_interrupt_lvd_IRQn           =  16,      /*!<  16 [Active] LVD */
  pass_0_interrupt_sar_IRQn         =  17,      /*!<  17 [Active] SAR ADC */
  csd_0_interrupt_IRQn              =  18,      /*!<  18 [Active] CSD #0 (CapSense) */
  csd_1_interrupt_IRQn              =  19,      /*!<  19 [Active] CSD #1 (CapSense) */
  tcpwm_interrupts_0_IRQn           =  20,      /*!<  20 [Active] TCPWM #0, Counter #0 */
  tcpwm_interrupts_1_IRQn           =  21,      /*!<  21 [Active] TCPWM #0, Counter #1 */
  tcpwm_interrupts_2_IRQn           =  22,      /*!<  22 [Active] TCPWM #0, Counter #2 */
  tcpwm_interrupts_3_IRQn           =  23,      /*!<  23 [Active] TCPWM #0, Counter #3 */
  tcpwm_interrupts_4_IRQn           =  24,      /*!<  24 [Active] TCPWM #0, Counter #4 */
  tcpwm_interrupts_5_IRQn           =  25,      /*!<  25 [Active] TCPWM #0, Counter #5 */
  tcpwm_interrupts_6_IRQn           =  26,      /*!<  26 [Active] TCPWM #0, Counter #6 */
  tcpwm_interrupts_7_IRQn           =  27,      /*!<  27 [Active] TCPWM #0, Counter #7 */
  can_0_interrupt_IRQn              =  28,      /*!<  28 [Active] CAN #0 Interrupt */
  can_1_interrupt_IRQn              =  29,      /*!<  29 [Active] CAN #1 Interrupt */
  usb_interrupt_sof_IRQn            =  30,      /*!<  30 [Active] USB SOF */
  usb_interrupt_ep_IRQn             =  31,      /*!<  31 [Active] USB EP1-EP8 */
  unconnected_IRQn                  = 240       /*!< 240 Unconnected */
} IRQn_Type;


/*******************************************************************************
*                    Processor and Core Peripheral Section
*******************************************************************************/

/* Configuration of the ARM Cortex-M0 Processor and Core Peripherals */
#define __CM0_REV                       0x0000U /*!< CM0 Core Revision */
#define __NVIC_PRIO_BITS                2       /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig          0       /*!< Set to 1 if different SysTick Config is used */
#define __VTOR_PRESENT                  0       /*!< CM0 has no Vector Table Offset Register */
#define __MPU_PRESENT                   0       /*!< CM0 has no MPU */

/** \} Configuration_of_CMSIS */

#include "core_cm0.h"                           /*!< ARM Cortex-M0 processor and core peripherals */


/* Memory Blocks */
#define CY_SRAM_BASE                    0x20000000UL
#define CY_SRAM_SIZE                    0x00008000UL
#define CY_FLASH_BASE                   0x00000000UL
#define CY_FLASH_SIZE                   0x00040000UL
#define CY_SFLASH_BASE                  0x0FFFF000UL
#define CY_SFLASH_SIZE                  0x00001000UL
#define CY_ROM_BASE                     0x10000000UL
#define CY_ROM_SIZE                     0x00002000UL


